# IsAutoShadingForLoadDisplay Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..IsAutoShadingForLoadDisplay Property
PanelScheduleData Class See Also
---
Display shading of load cells automatically or not.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool IsAutoShadingForLoadDisplay { get; set; }
```

Visual Basic
---
```text
Public Property IsAutoShadingForLoadDisplay As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsAutoShadingForLoadDisplay {
	bool get ();
	void set (bool value);
}
```

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace